; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v7 ?v3)
             (pred_2 ?v9 ?v4)
             (pred_10 ?v7 ?v4)
             (pred_12 ?v11 ?v7 )
	     (pred_8 ?v7)
             (pred_3 ?v5)
             (pred_5 ?v9)
             (pred_7 ?v4)
             (pred_9 ?v7)
             (pred_11 ?v9)
             (pred_6 ?v7)
             (pred_1 ))



(:action op_3
:parameters (?v12 ?v1 ?v6 ?v8)
:precondition (and (pred_3 ?v12) (pred_3 ?v1) (pred_5 ?v6) (pred_7 ?v8)
          (pred_4 ?v12 ?v1) (pred_2 ?v6 ?v8)
                   (pred_10 ?v1 ?v8) (pred_8 ?v12) 
                   (pred_9 ?v1) (pred_11 ?v6))
:effect (and  (pred_6 ?v1) (not (pred_9 ?v1))))


(:action op_4
:parameters (?v12 ?v2)
:precondition (and (pred_3 ?v12) (pred_3 ?v2)
               (pred_8 ?v12) (pred_4 ?v12 ?v2) (pred_6 ?v2))
:effect (and (pred_8 ?v2) (not (pred_8 ?v12))))

(:action op_5
:parameters (?v12 ?v6)
:precondition (and (pred_3 ?v12) (pred_5 ?v6) 
                  (pred_8 ?v12) (pred_12 ?v6 ?v12) (pred_1 ))
:effect (and (pred_11 ?v6)
   (not (pred_12 ?v6 ?v12)) (not (pred_1 ))))


(:action op_2
:parameters (?v12 ?v13 ?v10)
:precondition (and (pred_3 ?v12) (pred_5 ?v13) (pred_5 ?v10)
                  (pred_8 ?v12) (pred_11 ?v10) (pred_12 ?v13 ?v12))
:effect (and (pred_11 ?v13) (pred_12 ?v10 ?v12)
        (not (pred_11 ?v10)) (not (pred_12 ?v13 ?v12))))

(:action op_1
:parameters (?v12 ?v6)
:precondition (and (pred_3 ?v12) (pred_5 ?v6) 
                  (pred_8 ?v12) (pred_11 ?v6))
:effect (and (pred_1 ) (pred_12 ?v6 ?v12) (not (pred_11 ?v6)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_13 obj_11 obj_09 obj_12 obj_15 obj_14 obj_21 obj_07 obj_20 obj_03 obj_16 obj_10 obj_02 obj_06 obj_08
    obj_18 obj_17
    obj_01 obj_04 obj_05
    )

    (:init
       (pred_1)

       (pred_3 obj_19)
       (pred_3 obj_13)
       (pred_3 obj_11)
       (pred_3 obj_09)
       (pred_3 obj_12)
       (pred_3 obj_15)
       (pred_3 obj_14)
       (pred_3 obj_21)
       (pred_3 obj_07)
       (pred_3 obj_20)
       (pred_3 obj_03)
       (pred_3 obj_16)
       (pred_3 obj_10)
       (pred_3 obj_02)
       (pred_3 obj_06)
       (pred_3 obj_08)
       (pred_7 obj_18)
       (pred_7 obj_17)
       (pred_5 obj_01)
       (pred_5 obj_04)
       (pred_5 obj_05)

       (pred_4 obj_19 obj_12)
       (pred_4 obj_19 obj_13)
       (pred_4 obj_13 obj_15)
       (pred_4 obj_13 obj_11)
       (pred_4 obj_13 obj_19)
       (pred_4 obj_11 obj_14)
       (pred_4 obj_11 obj_09)
       (pred_4 obj_11 obj_13)
       (pred_4 obj_09 obj_21)
       (pred_4 obj_09 obj_11)
       (pred_4 obj_12 obj_07)
       (pred_4 obj_12 obj_15)
       (pred_4 obj_12 obj_19)
       (pred_4 obj_15 obj_20)
       (pred_4 obj_15 obj_14)
       (pred_4 obj_15 obj_13)
       (pred_4 obj_15 obj_12)
       (pred_4 obj_14 obj_03)
       (pred_4 obj_14 obj_21)
       (pred_4 obj_14 obj_11)
       (pred_4 obj_14 obj_15)
       (pred_4 obj_21 obj_16)
       (pred_4 obj_21 obj_09)
       (pred_4 obj_21 obj_14)
       (pred_4 obj_07 obj_10)
       (pred_4 obj_07 obj_20)
       (pred_4 obj_07 obj_12)
       (pred_4 obj_20 obj_02)
       (pred_4 obj_20 obj_03)
       (pred_4 obj_20 obj_15)
       (pred_4 obj_20 obj_07)
       (pred_4 obj_03 obj_06)
       (pred_4 obj_03 obj_16)
       (pred_4 obj_03 obj_14)
       (pred_4 obj_03 obj_20)
       (pred_4 obj_16 obj_08)
       (pred_4 obj_16 obj_21)
       (pred_4 obj_16 obj_03)
       (pred_4 obj_10 obj_02)
       (pred_4 obj_10 obj_07)
       (pred_4 obj_02 obj_06)
       (pred_4 obj_02 obj_20)
       (pred_4 obj_02 obj_10)
       (pred_4 obj_06 obj_08)
       (pred_4 obj_06 obj_03)
       (pred_4 obj_06 obj_02)
       (pred_4 obj_08 obj_16)
       (pred_4 obj_08 obj_06)
       (pred_9 obj_15)
       (pred_9 obj_08)
       (pred_9 obj_10)
       (pred_10  obj_15 obj_18)
       (pred_10  obj_08 obj_17)
       (pred_10  obj_10 obj_17)
       (pred_6 obj_19)
       (pred_6 obj_13)
       (pred_6 obj_11)
       (pred_6 obj_09)
       (pred_6 obj_12)
       (pred_6 obj_14)
       (pred_6 obj_21)
       (pred_6 obj_07)
       (pred_6 obj_20)
       (pred_6 obj_03)
       (pred_6 obj_16)
       (pred_6 obj_02)
       (pred_6 obj_06)

       (pred_2  obj_01 obj_18)
       (pred_2  obj_04 obj_17)
       (pred_2  obj_05 obj_17)
       (pred_12 obj_01 obj_20)
       (pred_12 obj_04 obj_20)
       (pred_12 obj_05 obj_06)
       (pred_8 obj_12)
    )

    (:goal (and
       (pred_12 obj_01 obj_07)
       (pred_12 obj_04 obj_07)
       (pred_12 obj_05 obj_21)
    ))
(:constraints
  (always (not (pred_8 obj_03)))
)
)

; plan
1. (op_4 obj_12 obj_07)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_07)
   goals met: 0 of 3
2. (op_4 obj_07 obj_20)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_20)
   goals met: 0 of 3
3. (op_5 obj_20 obj_04)
   deleted: (pred_12 obj_04 obj_20) (pred_1)
   added: (pred_11 obj_04)
   goals met: 0 of 3
4. (op_4 obj_20 obj_07)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_07)
   goals met: 0 of 3
5. (op_1 obj_07 obj_04)
   deleted: (pred_11 obj_04)
   added: (pred_1) (pred_12 obj_04 obj_07)
   goals met: 1 of 3
6. (op_4 obj_07 obj_20)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_20)
   goals met: 1 of 3
7. (op_5 obj_20 obj_01)
   deleted: (pred_12 obj_01 obj_20) (pred_1)
   added: (pred_11 obj_01)
   goals met: 1 of 3
8. (op_4 obj_20 obj_07)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_07)
   goals met: 1 of 3
9. (op_1 obj_07 obj_01)
   deleted: (pred_11 obj_01)
   added: (pred_1) (pred_12 obj_01 obj_07)
   goals met: 2 of 3
10. (op_4 obj_07 obj_20)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_20)
   goals met: 2 of 3
11. (op_4 obj_20 obj_02)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_02)
   goals met: 2 of 3
12. (op_4 obj_02 obj_06)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_06)
   goals met: 2 of 3
13. (op_5 obj_06 obj_05)
   deleted: (pred_12 obj_05 obj_06) (pred_1)
   added: (pred_11 obj_05)
   goals met: 2 of 3
14. (op_3 obj_06 obj_08 obj_05 obj_17)
   deleted: (pred_9 obj_08)
   added: (pred_6 obj_08)
   goals met: 2 of 3
15. (op_4 obj_06 obj_08)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_08)
   goals met: 2 of 3
16. (op_4 obj_08 obj_16)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_16)
   goals met: 2 of 3
17. (op_4 obj_16 obj_21)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_21)
   goals met: 2 of 3
18. (op_1 obj_21 obj_05)
   deleted: (pred_11 obj_05)
   added: (pred_1) (pred_12 obj_05 obj_21)
   goals met: 3 of 3
